artifacts/oscar_e2e/fig4_groups_sweep_qwen3_8b/bf16/in100000_bs32_g1/bench_serving.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=32200, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=32, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:32200/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=32200, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model='Qwen/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=32, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)


Loading cached generated input data from /root/.cache/sglang/benchmark/gen_shared_prefix_1_1_32_100000_128_1000_Qwen2Tokenizer.pkl
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     32        
Benchmark duration (s):                  123.29    
Total input tokens:                      3371395   
Total input text tokens:                 3371395   
Total generated tokens:                  32000     
Total generated tokens (retokenized):    11675     
Request throughput (req/s):              0.26      
Input token throughput (tok/s):          27345.90  
Output token throughput (tok/s):         259.56    
Peak output token throughput (tok/s):    1856.00   
Peak concurrent requests:                32        
Total token throughput (tok/s):          27605.46  
Concurrency:                             30.97     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   119330.45 
Median E2E Latency (ms):                 120478.54 
P90 E2E Latency (ms):                    122819.53 
P99 E2E Latency (ms):                    123122.88 
---------------Time to First Token----------------
Mean TTFT (ms):                          10413.96  
Median TTFT (ms):                        10409.09  
P99 TTFT (ms):                           10522.18  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          109.03    
Median TPOT (ms):                        110.18    
P99 TPOT (ms):                           112.73    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           109.03    
Median ITL (ms):                         116.52    
P95 ITL (ms):                            117.63    
P99 ITL (ms):                            129.79    
Max ITL (ms):                            163.61    
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [01:51<57:39, 111.60s/it]
  6%|▋         | 2/32 [01:52<23:13, 46.44s/it] 
  9%|▉         | 3/32 [01:53<12:21, 25.55s/it]
 12%|█▎        | 4/32 [01:53<07:20, 15.74s/it]
 16%|█▌        | 5/32 [01:54<04:38, 10.30s/it]
 19%|█▉        | 6/32 [01:55<03:03,  7.04s/it]
 22%|██▏       | 7/32 [01:55<02:04,  4.97s/it]
 25%|██▌       | 8/32 [01:56<01:27,  3.63s/it]
 28%|██▊       | 9/32 [01:57<01:01,  2.67s/it]
 31%|███▏      | 10/32 [01:57<00:44,  2.01s/it]
 34%|███▍      | 11/32 [01:58<00:32,  1.56s/it]
 38%|███▊      | 12/32 [01:58<00:24,  1.25s/it]
 41%|████      | 13/32 [01:59<00:19,  1.03s/it]
 44%|████▍     | 14/32 [01:59<00:14,  1.21it/s]
 47%|████▋     | 15/32 [02:00<00:11,  1.46it/s]
 50%|█████     | 16/32 [02:00<00:08,  1.79it/s]
 53%|█████▎    | 17/32 [02:00<00:07,  2.02it/s]
 56%|█████▋    | 18/32 [02:00<00:05,  2.35it/s]
 59%|█████▉    | 19/32 [02:01<00:04,  2.66it/s]
 62%|██████▎   | 20/32 [02:01<00:04,  2.72it/s]
 66%|██████▌   | 21/32 [02:01<00:03,  3.19it/s]
 69%|██████▉   | 22/32 [02:01<00:02,  3.80it/s]
 72%|███████▏  | 23/32 [02:02<00:02,  4.38it/s]
 75%|███████▌  | 24/32 [02:02<00:01,  4.60it/s]
 78%|███████▊  | 25/32 [02:02<00:01,  4.77it/s]
 84%|████████▍ | 27/32 [02:02<00:00,  5.98it/s]
 91%|█████████ | 29/32 [02:02<00:00,  6.75it/s]
 94%|█████████▍| 30/32 [02:03<00:00,  6.81it/s]
100%|██████████| 32/32 [02:03<00:00,  7.74it/s]
100%|██████████| 32/32 [02:03<00:00,  3.85s/it]